package days03;

// Ctrl + Shift + O 를 누르면 자동import 된다.

public class Ex08 {


	public static void main(String[] args) {
		/*
		 * 1. 연산자(operator): 연산을 수행하는 기호
		 *    예) + - * / 등등
		 * 2. 피연산자(operand): 연산의 대상
		 *    예)   3 + 5
		 * 3. 조건식: 참/거짓으로 판단되는 표현식
		 *    예)   3 > 5
		 *    수식, 식, 표현식(expression):  연산자와 피연산자를 조합하여 
		 *    계산하고자 하는 바를 표현한 것. 
		 *
		 *    
		 * 4. 연산자 종류   
		 *   1) 피연산자의 갯수에 따서 분류
		 *      단항연산자
		 *      이항연산자
		 *      삼항연산자
		 *      
		 *   2) 기능에 따라서 분류
		 *      산술연산자
		 *      비교연산자
		 *      논리연산자
		 *      대입연산자
		 *      조건연산자
		 *      등등
		 * */
	}

}
