package days11;

/**
 * @author scm
 * @date 2026. 5. 26. 오전 9:09:12
 * @subject 
 * @content
 */
public class Ex01 {

	public static void main(String[] args) {
		/* 1.객체지향프로그래밍 (OOP)
		 *  ㄴ
		 *  2. 객체(Object) : 물리적 존재 O + 개념적 존재 O 중 다른것과 식별가능한것
		 *  3. 객체 = 속성(필드) + 동작(메소드)
		 *             특징       일,기능
		 *             
		 *  4. 객체(클래스) 간의 관계
		 *    1) 집합 관계 : 자동차 객체 <- 엔진 객체 
		 *    2) 상속 관계 : 객체 <- 필드,메소드 - 객체
		 *    
		 *  5. OOP의 특징
		 *    1) 캡슐화(은닉화)
		 *    2) 상속성
		 *    3) 다형성
		 *    4) 추상화
		 *  6. 클래스 : 객체의 설계도
		 *  7. 인스턴스 : 클래스 -> 객체 생성한것
		 *                     인스턴스화
		 *  8. 클래스 선언
		 *    ㄴ 필드 + 메소드 선언
		 *    ㄴ Sample.java == 동일한 Sample클래스명
		 *    ㄴ 클래스 선언형식
		 *        modifiers(제한자)
		 *        [접] + [기] class 클래스명 [extends 부모 클래스] [implements 인터페이스...] }
		 *           멤버 == 객체(클래스)의 구성요소
		 *           1) 필드(==변수)
		 *           2) 메소드(==함수)
		 *           3) 생성자
		 *        }
		 *  9. 객체 모델링(Object Modeling) : 현실 세계의 객체를 소프트웨어 객체로 설계하는것(과정)
		 *  10. 클래스 설계하는 과정
		 *     1) 객체의 구성요소(속성,동작) 파막 -> 목록작성
		 *     2) 객체 모델링 - 필드,메서드 작성
		 *     3) 클래스 선언
		 *     4) 객체 생성 - 테스트
		 *     5) 문제적 파악 - 유지보수
		 *     6) 상용화
		 *     7) 기능추가, 또 문제점 파악 - 유지보수,버전관리
		 *     
		 *  11. 신형 자동차 클래스 설계
		 *     Car.java
		 *     
		 *  12. 필드는 초기화 하지 않아도, 객체가 생성될때 자료형의 기본값으로 초기화된다.
		*/ 

	}

}
