package days01;

/**
 * @author scm
 * @date 2026. 5. 11. 오후 4:25:23
 * @subject Java 프로그램의 기본구조설명
 * @content 클래스, main메서드(함수)
 */
public class Ex02 {

	public static void main(String[] args) {
		/*
		 * 1. 자바는 객체지향 프로그래밍 언어이기때문에 반드시 프로그램의 시작을 하는 시작개체(==객체, 클래스, 물건)가 필요하다. 
		 * 2. 자바에서는 클래스 선언 형식
		 * ===================================
		 * [접근지정자] class예약어 클래스명 { 
		 * }
		 * 클래스명은 자바파일명과 동일
		 * 클래스명은 대문자로 시작
		 * ===================================
		 * 
		 * public : 접근지정자
		 * class : 클래스 선언 예약어
		 * Ex02 : 클래스 이름
		 * public class Ex02 {
		 * }
		 * 
		 * 3. 프로그램의 시작/종료(진입점)하는 기능의 함수(메서드)가 필요하다. main 메서드(함수)
		 * 3-2. 실행하기
		 *     java Sample : command 창에서 실행
		 *     Ctrl + F11 : 이클립스 => 시작개체(main) => main메서드를 찾는다.
		 *     
		 * 4. 자바에서 메서드(함수) 선언 형식
		 *     Modifiers(한정자)
		 *   [접근지정자] [기타제어자] 리턴자료형 메서드명(매개변수) {
		 *   	[return 반환값;]
		 *   }
		 *   public static void main(String[] args) {
		 *   }
		 * 4-2. 메서드(함수) 3가지
		 * 	1) 기능 : 프로그램 시작/종료 일(기능)을 하는 함수
		 *  2) 매개변수
		 *  3) 리턴값
		 * */

	}

}
